{
    "Token must be present in request header.": "El token debe estar presente en el encabezado de la solicitud.",
    "Only explorers can create their own account.": "Solo los exploradores pueden crear su propia cuenta.",
    "Actor not found.": "Actor no encontrado.",
    "Actor successfully soft deleted.": "Actor eliminado con éxito.",
    "Error trying to find the actor.": "Error al intentar encontrar al actor.",
    "Actor is inactive.": "El actor está inactivo.",
    "Password did not match.": "La contraseña no coincidió.",
    "Error creating custom token.": "Error al crear token personalizado.",
    "Start year is not a valid year.": "El año de inicio no es un año válido.",
    "Start month is not a valid month.": "El mes de inicio no es un mes válido.",
    "End year is not a valid year.": "El año final no es un año válido.",
    "End month is not a valid month.": "El mes final no es un mes válido.",
    "Rebuild period successfully defined.": "Período de reconstrucción definido con éxito.",
    "Error trying to define the rebuild period.": "Error al intentar definir el período de reconstrucción.",
    "Keyword must be a single word.": "La palabra clave debe ser una sola palabra.",
    "Trip not found.": "Viaje no encontrado.",
    "Trip successfully deleted.": "Viaje eliminado con éxito.",
    "Cancel reason is mandatory for this operation.": "El motivo de cancelación es obligatorio para esta operación.", 
    "No actor was found with the given idToken.": "No se encontró ningún actor con el idToken dado.",
    "The actor has not the required roles.": "El actor no tiene los roles requeridos.",
    "Authenticated actor can not access this actor.": "El actor autenticado no puede acceder a este actor.",
    "Error trying to get the sponsorship.": "Error al intentar conseguir el patrocinio.",
    "Authenticated actor can not access this sponsorship.": "El actor autenticado no puede acceder a este patrocinio.",
    "Error trying to get the trip.": "Error al intentar conseguir el viaje.",
    "Authenticated actor can not access this trip.": "El actor autenticado no puede acceder a este viaje.",
    "Trip can not be published, modified or deleted because it is already published.": "El viaje no se puede publicar, modificar o eliminar porque ya está publicado.",
    "A trip that has not been published can not be cancelled.": "Un viaje que no ha sido publicado no se puede cancelar.",
    "A trip that has already started can not be cancelled.": "Un viaje que ya ha comenzado no se puede cancelar.",
    "Error trying to get the applications of the trip.": "Error al intentar obtener las solicitudes del viaje.",
    "A trip that already has accepted applications can not be cancelled.": "Un viaje que ya tiene solicitudes aceptadas no se puede cancelar."
}